docs/README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>README</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-02-12 13:58:40 EST"/>
<meta name="author" content="Sam Auciello"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">README</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 HOT COCOA LISP </a>
<ul>
<li><a href="#sec-1.1">1.1 High Level Design Goals </a></li>
<li><a href="#sec-1.2">1.2 Syntax </a></li>
<li><a href="#sec-1.3">1.3 Semantics </a>
<ul>
<li><a href="#sec-1.3.1">1.3.1 nop </a></li>
<li><a href="#sec-1.3.2">1.3.2 . </a></li>
<li><a href="#sec-1.3.3">1.3.3 get </a></li>
<li><a href="#sec-1.3.4">1.3.4 list </a></li>
<li><a href="#sec-1.3.5">1.3.5 object </a></li>
<li><a href="#sec-1.3.6">1.3.6 inherit </a></li>
<li><a href="#sec-1.3.7">1.3.7 if </a></li>
<li><a href="#sec-1.3.8">1.3.8 when </a></li>
<li><a href="#sec-1.3.9">1.3.9 cond </a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> HOT COCOA LISP </h2>
<div class="outline-text-2" id="text-1">

<p>Hot Cocoa Lisp is a dialect of Lisp designed to be compiled into
Javascript.  It has been said that Javascript is Scheme in C's
clothes.  Hot Cocoa Lisp is an attempt to put it back in Schemes
clothes.
</p>
</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> High Level Design Goals </h3>
<div class="outline-text-3" id="text-1.1">

<ul>
<li>
Provide a clean, intuitive interface to existing
Javascript libraries/frameworks
</li>
<li>
Use the minimal syntax of Lisp
</li>
<li>
Retain the good features of Javascript
(first-class functions with closures, Dynamic objects with prototypes,
Object literals).
</li>
<li>
Fix the problems of Javascript.
(Global variables, type coersion, etc.)
</li>
<li>
Provide some of the introspective power of Lisp (quoting, macros etc.)

</li>
</ul>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Syntax </h3>
<div class="outline-text-3" id="text-1.2">

<p>The syntax of Hot Cocoa Lisp is the same as that of Scheme with
four exceptions:
</p><ul>
<li>
As in clojure the <i>unquote</i> symbol is <i>~</i> instead of /,/.
</li>
<li>
The square bracket notation for Array literals from JavaScript
may be used but the commas are optional.

<pre class="example">
;; HCL
[1 2 3]
// JavaScript
[1, 2, 3]
</pre>


<p>
It is translated by the parser to the equivalent <i>(list 1 2 3)</i>.
</p>
</li>
<li>
The curly bracket notation for object literals from JavaScript
may be used but the commas and colons are optional.

<pre class="example">
;; HCL
{a 1 b 2}
// JavaScript
{a: 1, b: 2}
</pre>


<p>
It is translated by the parser to the equivalent <i>(object a 1 b 2)</i>.     
</p>
</li>
<li>
As in Javascript <i>.</i> can be used as an object access operator.
It works precisely as it does in JavaScript.

<pre class="example">
;; HCL
foo.bar
// JavaScript
foo.bar
</pre>


<p>
It is translated by the parser to the equivalent <i>(. foo bar)</i>.
</p>
<p>
It is also possible to use a lisp expression for the object being
accessed:
</p>
<pre class="example">
;; HCL
(some expression returning an object).keyname
// JavaScript
some(expression, returning, an, object).keyname
</pre>


</li>
</ul>

<p>Hot Cocoa Lisp can syntactically supports most of the literals from
Javascript:
</p><ul>
<li>
<i>undefined</i>, <i>null</i>, <i>true</i>, and <i>false</i> work exactly as they do
in JavaScript.
</li>
<li>
Numbers work just as they do in JavaScript.
</li>
<li>
Strings literals must use double quotes but otherwise function as
they do in JavaScript.
</li>
<li>
Functions, objects, arrays, and regular expressions are defined
by the built-in functions named <i>#</i>, <i>object</i>, <i>list</i>, and <i>re</i>
respectively.

</li>
</ul>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Semantics </h3>
<div class="outline-text-3" id="text-1.3">

<p>The basic logic for converting a lisp expression into compiled
JavaScript is quite simple.  If the first element of the expression
is a built-in function the compiler calls on internal logic to
compile the expression, otherwise each element is recursively
compiled and then output in the form <i>elem1(elem2, elem3, etc)</i>.
Most of the remaining semantic logic takes the form of built-in function
definitions.
</p>

</div>

<div id="outline-container-1.3.1" class="outline-4">
<h4 id="sec-1.3.1"><span class="section-number-4">1.3.1</span> nop </h4>
<div class="outline-text-4" id="text-1.3.1">

<p>Takes no arguments and returns undefined.
</p>
<pre class="example">
;; HCL
(for ((var i 0) (&lt; i 10) (++ i))
    (nop))
// JavaScript
for (var i = 0; i &lt; 10; i++) { }
</pre>


</div>

</div>

<div id="outline-container-1.3.2" class="outline-4">
<h4 id="sec-1.3.2"><span class="section-number-4">1.3.2</span> . </h4>
<div class="outline-text-4" id="text-1.3.2">

<p>Takes two or more arguments and does chained object access with
keys that were known at program writing time.
</p>
<pre class="example">
;; HCL
(. foo bar baz)
;; OR
foo.bar.baz
// JavaScript
foo.bar.baz
</pre>


</div>

</div>

<div id="outline-container-1.3.3" class="outline-4">
<h4 id="sec-1.3.3"><span class="section-number-4">1.3.3</span> get </h4>
<div class="outline-text-4" id="text-1.3.3">

<p>Takes exactly two arguments and does object/list access using a
key that might not be known until run time.
</p>
<pre class="example">
;; HCL
(get list 10)
// JavaScript
list[1]
</pre>


<p>
<b>Synonyms:</b> <i>nth</i>
</p>
</div>

</div>

<div id="outline-container-1.3.4" class="outline-4">
<h4 id="sec-1.3.4"><span class="section-number-4">1.3.4</span> list </h4>
<div class="outline-text-4" id="text-1.3.4">

<p>Create and return a new JavaScript array containing the given
arguments.
</p>
<pre class="example">
;; HCL
(list 1 2 3)
;; OR
[1 2 3]
// JavaScript
[1, 2, 3]
</pre>


<p>
<b>Synonyms:</b> <i>array</i>
</p>
</div>

</div>

<div id="outline-container-1.3.5" class="outline-4">
<h4 id="sec-1.3.5"><span class="section-number-4">1.3.5</span> object </h4>
<div class="outline-text-4" id="text-1.3.5">

<p>Takes an even number of arguments which it interprets pairwise as
key/value pairs for a new JavaScript object which it creates and
returns.
</p>
<pre class="example">
;; HCL
(object name "Sam" age 23)
;; OR
{ name "Sam" age 23 }
// JavaScript
{name: "Sam", age: 23}
</pre>


</div>

</div>

<div id="outline-container-1.3.6" class="outline-4">
<h4 id="sec-1.3.6"><span class="section-number-4">1.3.6</span> inherit </h4>
<div class="outline-text-4" id="text-1.3.6">

<p>Takes a single argument and returns a new empty object that
inherits prototypically fromt the argument.
</p>
<pre class="example">
;; HCL
(def x { a 1 })
(def y (inherit x))
y.a ; 1
// JavaScript
var x = {a: 1};
var y = Object.create(x);
y.a // 1
</pre>


</div>

</div>

<div id="outline-container-1.3.7" class="outline-4">
<h4 id="sec-1.3.7"><span class="section-number-4">1.3.7</span> if </h4>
<div class="outline-text-4" id="text-1.3.7">

<p>Takes three arguments and returns the second if the first is true
and the third if the first is false.
</p>
<pre class="example">
;; HCL
(if (= x 1) "one" "not one")
// JavaScript
((x === 1) ? "one" : "not one")
</pre>


</div>

</div>

<div id="outline-container-1.3.8" class="outline-4">
<h4 id="sec-1.3.8"><span class="section-number-4">1.3.8</span> when </h4>
<div class="outline-text-4" id="text-1.3.8">

<p>Takes two or more arguments and executes the expressions following
the first argument if the first argument is true
</p>
<pre class="example">
;; HCL
(when (= x 1) (console.log "x is one"))
// JavaScript
((x === 1) &amp;&amp; (function() { console.log("x is one"); })())
</pre>


</div>

</div>

<div id="outline-container-1.3.9" class="outline-4">
<h4 id="sec-1.3.9"><span class="section-number-4">1.3.9</span> cond </h4>
<div class="outline-text-4" id="text-1.3.9">




</div>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> FOOTNOTE DEFINITION NOT FOUND: 10
</p>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Sam Auciello
<a href="mailto:olleicua@mcdhcp77.marlboro.edu">&lt;olleicua@mcdhcp77.marlboro.edu&gt;</a>
</p>
<p class="date"> Date: 2013-02-12 13:58:40 EST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
